000
0101
0102
100
1900
1900s
1968
1970s
1983
1990
1990s
1991
1992
1994
1995
1996
1997
1998
1999
1stld
200
2000
2001
202
20th
212
21st
2ndtake
2takes
300
400
404
4204
500
526
5456
556
800
888
abc
ability
able
according
account
accounts
act
acting
action
active
actually
add
added
addition
additional
address
administration
ads
adv02
advantage
advertising
advice
affect
africa
african
afternoon
age
agencies
agency
agent
agents
ago
agree
ahead
air
airlines
airport
alexander
algeria
allen
allowed
aloni
amazing
america
american
americans
amount
amp
ams
analysts
ancient
angeles
ann
announced
annual
answer
anticipating
anymore
apartment
apparently
appeared
applewhite
approach
april
archbishop
architects
architecture
area
areas
aren
arena
arizona
arkansas
arm
armed
army
array
arrested
arrival
arrived
art
asked
assistant
association
athletes
athletic
atlanta
attack
attacks
attendance
attended
attention
audience
august
australia
author
authorities
authority
autobiography
avenue
average
aviation
avoid
award
baby
backed
backup
backward
bad
ball
baltimore
band
bank
banks
barely
base
baseball
based
basketball
battle
bay
beach
beamer
beamon
bears
beat
began
begin
beginning
begins
beijing
belatedly
belichick
believe
believed
believes
beneath
bianca
bible
big
bigger
biggest
bill
billion
bills
bird
birth
bishop
bit
black
block
blocks
blue
boat
bob
bobby
bond
book
boot
border
boris
born
bos
boston
bowden
bowl
boy
bradley
brazil
break
brien
bring
brings
britain
british
broadcast
broadway
broken
brooklyn
brother
brought
brown
bruce
bruins
bryant
budget
buffalo
bug
build
building
buildings
built
bull
burger
burundi
busch
buses
bush
business
businesses
buy
buying
calendar
calif
california
call
called
calling
calls
camp
campaign
campaigning
camps
canceled
candidate
candidates
cannibalism
cap
capital
capsule
car
cardinal
cardinals
care
career
carefully
carl
carolina
carroll
carruth
carry
cars
carter
case
cases
casey
cash
cast
catch
catching
category
cats
caught
caused
celebrate
celebrating
celebration
celebrations
cell
celtics
center
centers
central
century
certainly
chairman
challenge
challengers
champagne
championship
championships
chance
chances
change
changed
characters
charged
charges
charles
charlotte
chechen
chechnya
chicago
chief
chiefs
child
children
china
chinese
choice
chose
chris
christ
christian
christians
christmas
christopher
church
cities
citizens
city
civil
claim
class
clean
clear
clearly
cleveland
clients
clinton
clock
close
closed
closer
club
clubs
cnn
coach
coaches
coaching
coalition
coast
code
cold
collection
college
color
colorado
colts
columbus
column
com
combs
comes
comfortable
coming
command
commentary
commerce
commercial
commission
commissioner
commitment
committee
common
communications
communist
community
companies
company
compared
compensation
compete
competition
competitive
complete
completed
computer
computers
computing
concern
concerned
concerns
concert
conditions
conference
confetti
confidence
conflict
confused
congress
congressional
consecutive
consider
considered
constantly
constitution
consultants
continue
continued
continues
contract
control
convention
convinced
cooking
coordinator
corner
corporate
cost
cotton
couch
couldn
council
count
countries
country
county
couple
courage
course
court
cover
coverage
covered
cowboys
cox
coxnet
coxnews
create
created
crime
criminal
crisis
critical
criticism
critics
cross
crowd
crowded
crowds
crush
crystal
cuba
cubans
cultural
culture
cup
current
customers
cut
cuts
daily
dallas
dan
dancers
dancing
dark
data
date
dates
daughter
david
davis
dawn
days
dead
deal
death
dec
decade
decades
december
decided
decision
decisions
deep
defense
defensive
democracy
democratic
democrats
denver
department
deputy
des
describes
desk
despite
detroit
developed
development
devils
dictionary
didn
died
diego
diesel
difference
difficult
digital
dinner
direct
director
disappointed
discover
discuss
display
distance
district
division
doesn
dog
dollar
dollars
dome
donald
door
double
doubt
downtown
dozen
dozens
draft
draw
dream
drew
drive
driving
drop
dropped
drove
drug
drugs
duty
eagles
earlier
early
earned
earth
east
eastern
easy
eat
eating
economic
economy
editor
editors
eds
edward
effect
effective
effort
efforts
eighth
election
elections
electric
electronic
elias
elite
elizabeth
emerge
emergency
employees
empty
end
ended
ending
ends
engine
england
english
enter
entering
entertainment
entire
epic
era
especially
espn
est
established
estimated
ethnic
europe
european
europeans
eve
evening
event
events
eventually
evidence
evil
executive
exp
expansion
expect
expectations
expected
experience
experienced
experts
extra
extraordinary
eye
eyes
face
faces
fact
failed
failure
failures
faith
fall
fame
families
family
famous
fan
fans
fassel
fast
faster
fastest
father
fathers
favorite
fbc
fbn
fear
feared
fears
feature
feb
federal
feel
feeling
feels
feet
fell
felt
festivities
fewer
fff
ffff
fffx
ffx
ffxf
ffxx
field
fight
fighting
figure
figures
file
filed
filled
film
final
finally
financial
find
finding
finds
finish
finished
fire
fired
fireworks
firm
fix
fixed
flag
fleisher
flight
floor
florida
fly
flying
focus
focused
follow
follows
food
foot
football
force
forced
forces
forecast
foreign
forget
formed
fortson
forward
found
foundation
fourth
france
franchise
francisco
frank
free
freedom
french
frequently
freshman
friday
friendly
friends
front
full
fun
fund
fundamental
funds
future
fxf
fxff
fxfx
fxx
gains
game
games
garden
gary
gas
gate
gathered
gave
general
generally
generation
generations
george
georgia
getting
giants
gilmour
gisborne
giuliani
give
giving
glenn
glitch
glitches
global
globe
goal
goals
god
goes
going
gold
golden
golf
gore
gov
government
governments
grand
grandmother
graphic
graphics
gray
greater
greatest
green
greene
greenwich
greg
grew
griffey
ground
group
groups
grow
growing
grown
growth
grozny
guard
guess
guests
gun
guns
guy
guys
hair
half
hall
hampshire
hand
handed
hands
happen
happened
happens
happy
hard
harrison
harry
hasn
haven
head
headed
health
hear
heard
heart
heavily
heavy
heisman
held
help
helped
henry
high
higher
highly
hijackers
hijacking
hill
hispanic
historic
history
hit
hobson
hockey
hokies
hold
holding
holiday
hollywood
holy
home
hong
honor
hope
hopes
hoping
hornets
horns
horse
hospital
host
hostages
hot
hotel
hour
hours
house
houston
howard
hsi
huge
human
humanity
hundred
hundreds
hunting
hurt
husband
hutu
hybrid
hype
idea
ideas
ill
illegal
image
images
immediately
immigrants
immigration
impact
important
improve
incident
include
included
including
increase
increasing
independence
india
indian
individual
industrial
industry
inflation
information
injured
injuries
injury
inside
interest
interested
interesting
interests
international
internet
intersection
investment
involved
iowa
iqbal
irish
islamic
island
islands
isn
israel
issue
issued
issues
items
jack
jackson
james
jan
jane
january
japan
jason
jerry
jersey
jerusalem
jesus
jet
jets
jews
jim
job
jobs
joe
john
johnson
joined
jones
journal
journey
jump
june
junior
justice
juvenile
kan
kansas
keeping
keith
kennedy
kevin
key
keyword
kick
kid
kids
killed
killing
kind
king
knee
knew
knicks
known
knows
kong
koskinen
kraft
kremlin
kyrgyz
kyrgyzstan
labor
lack
lady
lakers
land
landmark
language
lardner
laredo
large
largely
larger
largest
late
later
latest
law
lawyer
lead
leader
leaders
leadership
leading
leads
league
leagues
learn
learned
leave
leaves
led
lee
left
lesson
letters
level
lewis
lifetime
light
lights
likely
likes
lincoln
line
lines
list
listen
live
lived
lives
living
local
locator
london
longer
longhorns
look
looked
looking
looks
los
lose
losing
loss
losses
lost
lot
lots
lott
louis
love
low
lower
lucas
luck
machines
magazine
mail
main
maine
major
majority
makes
making
mall
managed
management
manager
manas
manaschis
manhattan
map
march
marijuana
mark
market
marketing
markets
marks
martin
mary
maryland
mass
master
material
matter
matters
maurice
maybe
mayor
mccain
mean
meaning
means
media
medical
meet
meeting
megaart
member
members
memorial
merely
message
met
meter
mexico
miami
michael
microchips
mid
middle
midnight
midtown
mighty
migration
mike
mile
militants
military
millenium
millennial
millennium
miller
million
millions
mind
minister
ministry
minor
minute
minutes
missed
missing
mississippi
mitten
model
models
modern
mom
moment
moments
momentum
monday
money
monitoring
month
months
moon
moral
morning
moscow
mother
mount
move
moved
movement
moves
movie
moving
mrs
mta
muhammad
murder
murray
music
nadelmann
named
names
nation
national
nations
native
natural
nature
nba
nearly
nebraska
need
needed
needs
negative
net
nets
news
newscom
newspaper
newspapers
newyear
nfc
nfl
nhl
nice
night
nippon
nomination
non
noon
normal
north
northern
note
noted
notes
november
nuclear
number
numbers
nyt
nytimes
occasion
occurred
october
offense
offensive
offer
offered
offering
offers
office
officer
officers
official
officials
ohio
olives
olympic
olympics
online
open
opened
opening
operations
opportunity
optional
options
order
ordinary
organization
original
orlando
orleans
owner
owners
package
packed
packers
page
paid
pakistan
panthers
paper
parade
parcells
parents
park
part
parties
parts
party
pass
passed
passengers
passes
passing
past
pat
patriots
paul
pay
paying
pdf
peace
percent
perfect
performance
performed
period
person
personal
personally
personnel
pete
peter
phil
philadelphia
phoenix
phone
photo
photographs
photos
pick
picked
piece
pittsburgh
place
places
plain
plan
plane
planned
planning
plano
plans
plant
plants
play
played
player
players
playing
playoff
playoffs
plays
plummer
point
points
police
policy
political
politician
politicians
politics
polls
pollution
poor
pop
pope
popular
population
position
positive
post
potential
pounds
power
powerful
practice
prayer
predicted
prepared
present
president
presidential
press
pretty
previous
price
prices
primaries
primary
prime
primeau
priority
prison
private
prize
pro
problem
problems
process
produced
professional
professor
program
programs
progress
project
projects
protect
proud
provided
public
published
pulled
purchases
pushed
put
putin
putting
quality
quarter
quarterback
quarterbacks
question
questions
quick
quickly
quiet
quit
race
racial
racing
radio
rain
raise
raised
raising
ran
random
range
ranked
rate
ray
razorbacks
reach
reached
read
ready
real
realize
reason
rebels
recalls
received
receiver
receiving
recent
recently
record
records
red
reflect
reflected
reform
refused
region
regular
related
release
released
religious
remain
remains
remarkable
remember
replace
report
reported
reporter
reporters
reports
represents
republic
republican
republicans
reputation
research
residents
respect
rest
result
resumes
retailers
retired
retirement
return
returned
returning
revelers
review
revolution
rice
rich
richard
richardson
rick
rights
riley
ring
rio
rise
rival
river
road
roads
robert
rock
rockets
role
rolled
rollover
rome
rookie
room
rose
round
row
rule
rules
run
running
runs
rushing
rusie
russia
russian
russians
rwanda
sacks
safety
saigh
salary
sales
san
sanders
sat
satellite
saturday
savannah
saw
say
saying
says
scale
scene
schedule
scheduled
scholastic
school
schools
science
score
scored
scoring
scott
screen
search
season
seasons
seat
seats
seattle
seconds
secretary
security
seek
seeking
seemingly
seen
sell
seminoles
sen
senate
senior
sense
series
served
service
services
serving
set
setting
settled
seventh
shape
share
shooting
short
shortly
shot
shots
show
showed
shown
shows
shut
side
sides
sign
signed
significance
significant
signing
signs
silver
similar
simon
simple
simply
singing
single
sit
site
sites
situation
size
skills
sky
sleep
slightly
slot
small
smaller
smith
snow
soccer
social
society
sold
soldiers
son
song
soon
sort
sought
sounds
south
southern
soviet
sox
space
spanish
special
spectacle
spectacular
speech
speed
spend
spending
spent
spokesman
spokeswoman
sport
sports
spot
spread
spring
square
stadium
staff
stage
stand
standard
standing
stands
stanford
stanley
star
stars
start
started
starting
statement
states
station
status
stay
stayed
steadily
steady
steel
step
steps
steve
stock
stocks
stop
stopped
stores
stories
story
straight
streak
street
streets
strong
struck
study
style
submitted
success
suddenly
suffered
sugar
summer
summoned
sun
sunday
super
supply
support
supposed
sure
surgery
survive
survived
susan
suspended
swept
swing
syracuse
system
systems
table
tackle
takes
taking
talent
talk
talking
tampa
task
tax
taylor
teacher
team
teammates
teams
tech
technological
technology
television
tell
tells
tennessee
tennis
term
terms
terrorism
terrorist
terrorists
test
texas
text
thing
things
think
thinking
thomas
thought
thousand
thousands
threat
throw
thursday
tickets
tie
ties
tight
tim
times
timessquare
tired
title
today
todd
tokyo
told
tom
tomjanovich
tonight
tony
took
top
total
touchdown
tough
tourists
town
track
trade
traded
tradition
traditional
traditionally
traffic
training
transition
transportation
travel
traveled
tried
trim
trip
troops
trouble
true
truly
trump
trust
truth
try
trying
tuesday
turn
turned
turner
turns
tutsi
undated
understand
union
united
university
unrestricted
unusual
upper
valley
values
van
vast
veteran
vice
vick
victories
victory
video
view
violence
virginia
virtually
visit
vladimir
voice
volunteers
vote
voters
wait
waited
waiting
walk
wall
walter
want
wanted
wants
war
warn
warrick
wars
washington
wasn
watch
watched
watching
water
ways
wearing
weather
web
wednesday
week
weekend
weekly
weeks
welcomed
weren
west
western
white
wide
widely
widespread
wieck
wife
wild
william
williams
win
wind
window
windows
winner
winning
wins
winter
wisconsin
woman
women
won
wonder
woods
woodyard
word
wordage
words
worked
workers
working
works
worldwide
worried
worse
worst
worth
wouldn
writers
writing
written
wrong
wrote
www
xff
xfff
xffx
xffxf
xfx
xxf
y2k
yard
yards
yeltsin
yes
york
young
zealand
zone
zones
