000
0101
0102
100
1900
1900s
1950s
1968
1970s
1983
1990
1990s
1991
1992
1993
1994
1995
1996
1997
1998
1999
1stld
200
2000
2001
202
20th
212
21st
2ndtake
2takes
300
400
404
4204
500
526
5456
556
800
888
90s
abc
ability
able
accept
accepted
according
account
accounts
accused
act
acting
action
active
actually
add
added
adding
addition
additional
address
administration
ads
adv02
advantage
advertising
advice
affect
affected
afghanistan
afraid
africa
african
afternoon
age
agencies
agency
agent
agents
ago
agree
agreement
ahead
air
airlines
airport
alarm
alexander
algeria
algerian
allen
allowed
aloni
amazing
america
american
americans
amid
amount
amp
ams
analysts
anasazi
ancient
angeles
ann
announced
annual
answer
anticipating
anymore
apartment
apparently
appeared
applewhite
approach
april
archbishop
architects
architecture
area
areas
aren
arena
argue
arizona
arkansas
arm
armed
army
array
arrested
arrival
arrived
art
asked
assistant
association
athletes
athletic
atlanta
attack
attacks
attendance
attended
attention
audience
august
australia
author
authorities
authority
autobiography
automatically
avenue
average
aviation
avoid
award
baby
backed
backup
backward
bad
ball
baltimore
band
bank
banks
barbara
barely
base
baseball
based
basketball
battle
bay
beach
beamer
beamon
bears
beat
began
begin
beginning
begins
begun
beijing
belatedly
belichick
believe
believed
believes
beneath
bianca
bible
big
bigger
biggest
bill
billion
bills
bird
birth
bishop
bit
black
block
blocks
blood
blue
boat
bob
bobby
body
bomb
bond
bones
book
boot
border
boris
born
bos
boston
bowden
bowl
boy
bradley
brazil
break
breaks
brien
bring
brings
britain
british
broad
broadcast
broadway
broken
brooklyn
brother
brought
brown
bruce
bruins
bryant
budget
buffalo
bug
build
building
buildings
built
bull
burger
burundi
busch
buses
bush
business
businesses
buy
buying
calendar
calif
california
call
called
calling
calls
camp
campaign
campaigning
campaigns
camps
canadian
canceled
candidate
candidates
cannibalism
cap
capital
capsule
car
cardinal
cardinals
care
career
carefully
carl
carolina
carroll
carruth
carry
carrying
cars
carter
case
cases
casey
cash
cast
casualties
catch
catching
category
cats
caught
caused
celebrate
celebrating
celebration
celebrations
cell
celtics
center
centers
central
century
certainly
chairman
challenge
challengers
champagne
championship
championships
chance
chances
change
changed
chaos
character
characters
charged
charges
charles
charlotte
chechen
chechnya
chicago
chief
chiefs
child
children
china
chinese
choice
chose
chris
christ
christian
christians
christmas
christopher
church
cited
cities
citizens
citizenship
city
civil
claim
class
clean
clear
clearly
cleveland
clients
clinton
clock
close
closed
closer
clouds
club
clubs
cnn
coach
coaches
coaching
coalition
coast
code
cold
collection
college
colonial
colonists
color
colorado
colts
columbus
column
com
combination
combs
comes
comfortable
coming
command
commentary
commerce
commercial
commission
commissioner
commitment
committed
committee
common
communications
communist
community
companies
company
compared
compensation
compete
competition
competitive
complete
completed
computer
computers
computing
concern
concerned
concerns
concert
conditions
conference
confetti
confidence
conflict
confused
congo
congress
congressional
consecutive
consider
considered
constantly
constitution
consultant
consultants
contact
contests
continue
continued
continues
contract
contrast
control
controlled
convention
convinced
cook
cooking
coordinator
core
corner
corporate
cost
cotton
couch
couldn
council
count
countdown
countries
country
county
coup
couple
courage
course
court
cover
coverage
covered
cowboys
cox
coxnet
coxnews
create
created
crime
crimes
criminal
crisis
critical
criticism
critics
cross
crowd
crowded
crowds
crucial
crush
crystal
cuba
cubans
cultural
culture
cup
current
customers
cut
cuts
daily
dallas
damage
dame
dan
dancers
dancing
dangerous
dark
data
date
dates
daughter
david
davis
dawn
days
dead
deal
death
debate
dec
decade
decades
december
decided
decision
decisions
declared
decline
deep
defense
defensive
delegates
delivered
democracy
democratic
democrats
denver
department
deputy
des
describes
design
designed
desire
desk
despite
detroit
developed
development
devils
dictionary
didn
died
diego
diesel
difference
difficult
digital
dinner
direct
director
disappointed
discipline
discover
discuss
display
distance
district
division
doesn
dog
dole
dollar
dollars
dome
domestic
donald
door
double
doubt
doubts
downtown
dozen
dozens
draft
draw
drawn
dream
drew
drive
driving
drop
dropped
drove
drug
drugs
duty
eagles
earlier
early
earned
earth
east
eastern
easy
eat
eating
eck
economic
economy
editor
editors
eds
education
edward
effect
effective
effort
efforts
eighth
elected
election
elections
electric
electronic
elias
elite
elizabeth
emerge
emergency
employees
empty
end
ended
ending
ends
energy
engaged
engine
england
english
enormous
enter
entering
entertainment
entire
epic
episodes
era
especially
espn
est
established
estimated
estimates
ethnic
europe
european
europeans
eve
evening
event
events
eventually
evidence
evil
executive
exp
expansion
expect
expectations
expected
experience
experienced
experts
extra
extraordinary
extremely
eye
eyes
face
faces
facilities
fact
failed
failure
failures
faith
fall
falling
fame
families
family
famous
fan
fans
farm
farmers
fassel
fast
faster
fastest
father
fathers
favorite
fbc
fbn
fear
feared
fears
feature
feb
february
federal
feel
feeling
feelings
feels
feet
fell
fellow
felt
festivities
fewer
fff
ffff
fffx
ffx
ffxf
ffxx
field
fight
fighting
figure
figures
file
filed
fill
filled
film
final
finally
financial
find
finding
finds
fine
finish
finished
fire
fired
fireworks
firm
fix
fixed
flag
fleisher
flesh
flight
floor
florida
fly
flying
focus
focused
follow
follows
food
foot
football
force
forced
forces
forecast
foreign
forges
forget
form
formed
fortson
forward
fought
found
foundation
fourth
france
franchise
francisco
frank
free
freedom
french
frequently
freshman
friday
friend
friendly
friends
front
full
fun
fund
fundamental
funds
future
fxf
fxff
fxfx
fxx
gains
game
games
garden
garvey
gary
gas
gate
gathered
gave
general
generally
generation
generations
genocide
george
georgia
germany
getting
giants
gilmour
gisborne
giuliani
give
giving
glenn
glitch
glitches
global
globe
goal
goals
god
goes
going
gold
golden
golf
gore
gov
government
governments
grand
grandmother
graphic
graphics
gray
greater
greatest
green
greene
greenwich
greg
grew
grid
griffey
ground
group
groups
grow
growing
grown
growth
grozny
guard
guerrillas
guess
guests
gun
guns
guy
guys
hair
half
hall
hampshire
hand
handed
hands
happen
happened
happens
happy
hard
harrison
harry
hasn
hatreds
haven
head
headed
health
hear
heard
heart
heavily
heavy
heisman
held
help
helped
helping
henry
high
higher
highest
highlight
highly
hijackers
hijacking
hill
hispanic
historian
historic
history
hit
hobson
hockey
hokies
hold
holding
holiday
hollywood
holy
home
hong
honor
hope
hopes
hoping
horn
hornets
horns
horse
hospital
host
hostages
hot
hotel
hour
hours
house
houston
howard
hsi
huge
human
humanity
hundred
hundreds
hunting
hurt
husband
hutu
hybrid
hype
idea
ideas
ill
illegal
image
images
immediately
immigrants
immigration
impact
importance
important
impossible
improve
incident
include
included
including
increase
increased
increasing
independence
independent
india
indian
indians
individual
industrial
industry
inflation
influence
information
injured
injuries
injury
inside
intelligence
interest
interested
interesting
interests
international
internet
intersection
investigation
investment
investments
involved
iowa
iqbal
irish
islamic
island
islands
isn
israel
issue
issued
issues
items
jack
jackson
james
jan
jane
january
japan
japanese
jason
jerry
jersey
jerusalem
jesus
jet
jets
jews
jim
job
jobs
joe
john
johnson
joined
jones
journal
journey
jump
june
junior
justice
juvenile
kan
kansas
keeping
keith
kennedy
kevin
key
keyword
kick
kid
kids
killed
killing
kind
king
knee
knew
knicks
known
knows
kong
koskinen
kraft
kremlin
kyrgyz
kyrgyzstan
labor
lack
lady
lakers
lakes
land
landmark
language
lardner
laredo
large
largely
larger
largest
late
later
latest
law
laws
lawyer
lead
leader
leaders
leadership
leading
leads
league
leagues
learn
learned
leave
leaves
led
lee
left
legs
lenin
lesson
letters
level
levels
lewis
lifetime
light
lights
likely
likes
lincoln
line
lines
linked
list
listen
live
lived
lives
living
local
locator
london
longer
longhorns
look
looked
looking
looks
los
lose
losing
loss
losses
lost
lot
lots
lott
louis
love
low
lower
lucas
luck
machines
mad
magazine
mail
main
maine
major
majority
makes
making
mall
managed
management
manager
manas
manaschis
manhattan
manner
map
march
marijuana
mark
market
marketing
markets
marks
martin
mary
maryland
mass
master
material
matter
matters
maurice
maybe
mayor
mccain
mean
meaning
means
meant
media
medical
meet
meeting
megaart
member
members
memorial
merely
message
met
meter
mexico
miami
michael
microchips
mid
middle
midnight
midtown
mighty
migration
mike
mile
miles
militants
military
millenium
millennial
millennium
miller
million
millions
mind
minister
ministry
minor
minority
minute
minutes
missed
missing
mississippi
mistakes
mitten
model
models
modern
mom
moment
moments
momentum
monday
money
monitoring
month
months
moon
moral
morning
moscow
mother
mount
move
moved
movement
moves
movie
moving
mrs
mta
muhammad
murder
murray
music
mutual
nadelmann
named
names
narrow
nation
national
nations
native
natural
nature
nba
nearly
nebraska
need
needed
needs
negative
net
nets
network
news
newscom
newspaper
newspapers
newyear
nfc
nfl
nhl
nice
night
nippon
nomination
nominee
non
noon
normal
north
northern
note
noted
notes
november
nuclear
number
numbers
nyt
nytimes
occasion
occur
occurred
oct
october
offense
offensive
offer
offered
offering
offers
office
officer
officers
offices
official
officially
officials
ohio
oil
older
olives
olympic
olympics
online
open
opened
opening
operations
opportunity
optional
options
order
ordinary
organization
original
orlando
orleans
outsiders
outstanding
overseas
owner
owners
package
packed
packers
page
paid
pakistan
panthers
paper
parade
parcells
parent
parents
park
part
participations
parties
parts
party
pass
passed
passengers
passes
passing
past
pat
patriots
paul
pay
paying
pdf
peace
percent
perfect
performance
performed
period
person
personal
personally
personnel
perspective
pete
peter
phenomenon
phil
philadelphia
phoenix
phone
photo
photographs
photos
physical
pick
picked
piece
pittsburgh
place
places
plain
plan
plane
planned
planning
plano
plans
plant
plants
play
played
player
players
playing
playoff
playoffs
plays
plenty
plummer
point
pointed
points
police
policy
political
politician
politicians
politics
polls
pollution
pool
poor
pop
pope
popular
popularity
population
position
positive
post
potential
pounds
power
powerful
practice
practices
prayer
pre
precaution
predicted
preferred
prepare
prepared
preparing
present
preserve
presidency
president
presidential
press
pressure
pretty
previous
price
prices
primaries
primary
prime
primeau
priority
prison
private
prize
pro
problem
problems
process
produced
products
professional
professor
program
programs
progress
project
projects
promised
property
prosecutors
protect
proud
provided
public
published
pulled
purchases
pushed
pushing
put
putin
putting
quality
quarter
quarterback
quarterbacks
question
questions
quick
quickly
quiet
quit
race
races
racial
racing
radio
rain
raise
raised
raising
ran
random
range
ranked
rate
rating
ray
razorbacks
reach
reached
read
ready
real
realize
reason
rebels
recalls
received
receiver
receiving
recent
recently
record
records
red
reflect
reflected
reform
refused
region
regular
related
relations
relatives
release
released
religious
remain
remains
remarkable
remember
remembered
remote
rent
replace
report
reported
reporter
reporters
reports
represent
represents
republic
republican
republicans
reputation
research
residents
respect
response
ressam
rest
result
resumes
retailers
retired
retirement
return
returned
returning
revelers
review
revolution
rice
rich
richard
richardson
rick
rights
riley
ring
rio
rise
rising
rival
river
road
roads
robert
rock
rockets
role
roll
rolled
rollover
rome
rookie
room
roosevelt
rose
round
row
rule
rules
rumors
run
running
runs
rushing
rusie
russia
russian
russians
rwanda
sacks
safety
saigh
salary
sales
san
sanders
sat
satellite
saturday
savannah
saw
say
saying
says
scale
scene
schedule
scheduled
scholars
scholastic
school
schools
science
score
scored
scores
scoring
scott
screen
search
season
seasons
seat
seats
seattle
seconds
secret
secretary
security
seeing
seek
seeking
seemingly
seen
seize
selected
selection
sell
seminoles
sen
senate
senior
sense
sentences
separate
series
seriously
served
service
services
serving
set
setting
settled
seventh
shape
share
shoot
shooting
short
shortly
shot
shots
show
showed
shown
shows
shut
side
sides
sign
signed
significance
significant
signing
signs
silver
similar
simon
simple
simply
singing
single
sit
site
sites
situation
size
skills
sky
sleep
slightly
slot
small
smaller
smith
smiths
smoothly
snow
sobchak
soccer
social
societies
society
software
sold
soldiers
son
song
soon
sophisticated
sort
sought
sound
sounds
source
south
southern
soviet
sox
space
spanish
special
spectacle
spectacular
speech
speed
spend
spending
spent
spokesman
spokeswoman
sport
sports
spot
spread
spring
square
stadium
staff
stage
stand
standard
standards
standing
stands
stanford
stanley
star
stars
start
started
starting
statement
states
station
status
stay
stayed
steadily
steady
steel
step
steps
steve
stock
stocks
stood
stop
stopped
stores
stories
story
straight
streak
street
streets
strong
struck
studies
study
style
subject
submitted
success
successor
suddenly
suffered
sugar
summer
summoned
sun
sunday
super
supply
support
supporters
supposed
sure
surgery
surprise
surprising
surprisingly
surrounding
survive
survived
susan
suspended
swept
swing
switched
syracuse
system
systems
table
tackle
takes
taking
talent
talk
talking
tampa
task
tax
taylor
teacher
team
teammates
teams
tech
technological
technology
telecommunications
television
tell
tells
temporarily
temporary
tended
tennessee
tennis
term
terms
terrorism
terrorist
terrorists
test
testing
tests
texas
text
thing
things
think
thinking
thomas
thought
thousand
thousands
threat
throw
thursday
tickets
tie
ties
tight
tim
times
timessquare
tired
title
today
todd
tokyo
told
tom
tomjanovich
tonight
tony
took
top
total
touchdown
tough
tourists
town
townsend
track
trade
traded
tradition
traditional
traditionally
traffic
train
training
trains
transferor
transition
transportation
travel
traveled
tried
trim
trip
troops
trouble
true
truly
trump
trust
truth
try
trying
tuesday
turn
turned
turner
turns
tutsi
undated
understand
union
united
university
unrestricted
unusual
upbeat
upper
usual
valley
values
van
vast
verge
veteran
vice
vick
victories
victory
video
view
viewed
views
violence
virginia
virtually
visit
vladimir
voice
volunteers
vote
voters
wait
waited
waiting
walk
wall
walls
walter
want
wanted
wants
war
warn
warned
warrick
wars
washington
wasn
watch
watched
watching
water
ways
wearing
weather
web
wednesday
week
weekend
weekly
weeks
welcomed
wells
weren
west
western
white
wide
widely
widespread
wieck
wife
wild
william
williams
win
wind
window
windows
winner
winning
wins
winter
wisconsin
woman
women
won
wonder
woods
woodyard
word
wordage
words
worked
workers
working
works
worldwide
worried
worse
worst
worth
wouldn
writers
writes
writing
written
wrong
wrote
www
xff
xfff
xffx
xffxf
xfx
xxf
y2k
yard
yards
yeltsin
yes
york
young
zealand
zone
zones
